tap "aymanbagabas/tap"
tap "fluxcd/tap"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "mirceanton/taps"
tap "kanidm/kanidm"
tap "terror/tap"

brew "age"
brew "atuin"
brew "bash"
brew "bat"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-compose"
brew "doggo"
brew "eza"
brew "findutils"
brew "fish"
brew "fzf"
brew "gawk"
brew "gcli"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gum"
brew "helm"
brew "helmfile"
brew "helm-docs"
brew "helm-ls"
brew "jq"
brew "just"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kubecolor"
brew "kustomize"
brew "lazygit"
brew "mas"
brew "minijinja-cli"
brew "mise"
brew "neovim"
brew "opencode"
brew "pinentry-mac"
brew "rtk"
brew "shellcheck"
brew "sops"
brew "starship"
brew "stern"
brew "talosctl"
brew "telnet"
brew "viddy"
brew "wget"
brew "yamlfmt"
brew "yamllint"
brew "yq"
brew "zoxide"
brew "aymanbagabas/tap/shcopy"
brew "fluxcd/tap/flux"
brew "kanidm/kanidm/kanidm"
brew "mirceanton/taps/kubectl-switch"
brew "terror/tap/just-lsp"

cask "1password"
cask "1password-cli"
cask "acorn"
cask "alfred"
cask "autodesk-fusion"
cask "bambu-studio"
cask "betterdisplay"
cask "bettermouse"
cask "claude"
cask "discord"
cask "docker-desktop"
cask "fontbase"
cask "font-monaspace-nf"
cask "ghostty"
cask "google-chrome"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keka"
cask "kekaexternalhelper"
cask "keyboard-maestro"
cask "little-snitch"
cask "lm-studio"
cask "maccy"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "nextcloud"
cask "obsidian"
cask "onecast"
cask "rectangle-pro"
cask "signal"
cask "shottr"
cask "swiftbar"
cask "slack"
cask "tableplus"
cask "tailscale-app"
cask "thaw"
cask "transmit"
cask "visual-studio-code"
cask "goreleaser/tap/goreleaser"

mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "karakeeper", id: 6746722790
mas "Keynote", id: 361285480
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "Passepartout", id: 1433648537
mas "ReadKit", id: 1615798039
mas "Sink It for Reddit", id: 6449873635
mas "xSearch for Safari", id: 1579902068

vscode "bluebrown.yamlfmt"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "continue.continue"
vscode "esbenp.prettier-vscode"
vscode "fnando.linter"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "helm-ls.helm-ls"
vscode "hverlin.mise-vscode"
vscode "ionutvmi.path-autocomplete"
vscode "jinliming2.vscode-go-template"
vscode "luisfontes19.vscode-swissknife"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.remote-explorer"
vscode "ndonfris.fish-lsp"
vscode "nefrob.vscode-just-syntax"
vscode "orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "samuelcolvin.jinjahtml"
vscode "savh.json5-kit"
vscode "tamasfe.even-better-toml"

{{ if (not .isWorkComputer) }}
cask "android-platform-tools"
cask "anylist"
cask "autodesk-fusion"
cask "calibre"
cask "openscad@snapshot"
cask "windows-app"

mas "Labelife", id: 1560922539
{{ else }}
cask "citrix-workspace"
cask "google-drive"
{{ end }}
